Revit 2024 API
StructuralSectionAnalysisParams Class
 Defines common set of parameters for structural analysis.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public class StructuralSectionAnalysisParams : IDisposable
Visual Basic
Public Class StructuralSectionAnalysisParams _
	Implements IDisposable
Visual C++
public ref class StructuralSectionAnalysisParams : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionAnalysisParams
See Also
StructuralSectionAnalysisParams Members
Autodesk.Revit.DB.Structure.StructuralSections Namespace